// 210421 메모 내용
//TODO - 각 카테고리별 배열로 설정하여 구매하는 방법
//
//구매방법 1
//for (_viItem = _vItem.begin(); _viItem != _vItem.end(); ++_viItem)
//{
//	if (_user_chioce == _viItem->number)
//	{
//		// TODO - 사고나서 빠지고.
//		// 아무튼삿다 -> 항목삭제
//		
//		// 구매 (중복구매허용, 매장에서 수량부족, 중복구매 불가능==상점샀으면 상점벡터에 구매한 상품항목삭제)
//	}
//}
//
//getVShopItem();
//getVShopItem은 정보를 가져오게 
//내가 고른 아이템을 찾아내고
//인벤토리에 저장하고

// 210422 메모 내용
// H ~ 시작하는 것 = 핸들.
// 인스턴스 : 메모리 상에 할당되어 실행중인 프로그램 - OS를 확인하기 위한 값
// 윈도우 핸들 : 대상끼리 구분하기 위해 사용한다.

// 내일 할거 ~
// HBRUSH, HPEN, SelectObject()